---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
source: html/cffc629d-4b07-4534-68a7-da4ef85a2830.htm
---
# RebarShapeConstraintProjectedSegmentLength Members

Constructs a new instance of a RebarConstraintProjectEdgedLength object using a shape
 parameter, direction, and reference types.